{
  "Index": {
    "title": "Hola, soy ",
    "description": "Desarrollador de software especializado en Frontend y Mobile",
    "projectsButton": "Ver mis proyectos",
    "projects": "Proyectos",
    "portfolio": "Descubre cómo he desarrollado este portfolio",
    "techstack": "Tecnologías"
  },
  "Navbar": {
    "index": "Inicio",
    "projects": "Proyectos",
    "experience": "Experiencia",
    "aboutme": "Sobre mí",
    "contact": "Contacto"
  },
  "About": {
    "title": "Desarrollo de mi Portfolio Web",
    "intro": "Explora las tecnologías y técnicas detrás de este proyecto.",
    "technologiesTitle": "Tecnologías usadas",
    "nextjs": "Next.js 14",
    "nextjsDesc": "Framework moderno y optimizado. Ideal para posicionamiento SEO.",
    "notionAPI": "API de Notion",
    "notionDesc": "Base de datos para gestionar proyectos y alimentar los datos de esta web.",
    "i18n": "i18n",
    "i18nDesc": "Soporte para idioma español e inglés en toda la web.",
    "tailwind": "TailwindCSS",
    "tailwindDesc": "Diseño moderno, adaptado a los dispositivos y modo claro y oscuro.",
    "hosting": "Hosting y CI/CD",
    "hostingDesc": "Proyecto desplegado en Vercel con entrega continua desde GitHub",
    "featuresTitle": "Funcionalidades Destacadas",
    "featuresIntro": "Este portafolio incluye características avanzadas como:",
    "featureMultilanguage": "Multilenguaje con i18n",
    "featureResponsive": "Diseño completamente responsivo",
    "featureSEO": "Optimización de SEO y rendimiento",
    "featureDark": "Modo claro y oscuro",
    "aboutTitle": "Por qué crear un proyecto como este",
    "aboutParagraph": "En esta web desarrollo los conceptos más comunes requeridos para grandes proyectos de software.",
    "aboutParagraph2": "También muestro proyectos reales en los que he implementado otras funcionalidades no presentes en este proyecto.",
    "developmentProcessTitle": "Proceso de Desarrollo",
    "developmentProcessText": "He empleado varios meses de planificación conceptual y desarrollo para ofrecer lo mejor de mí en este proyecto.",
    "conclusion": "Gracias por visitar mi portafolio. ¡Espero que disfrutes explorándolo tanto como yo disfruté creándolo!",
    "mail": "Correos con Nodemailer",
    "mailDesc": "Usted y yo recibiremos un correo electrónico al hacer uso del formulario de contacto."
  },
  "Detail": {
    "active": "En producción",
    "unactive": "Discontinuado"
  },
  "Me": {
    "name": "Humberto Gabriel López Trigueros",
    "jobTitle": "Desarrollador de software",
    "dateOfBirthLabel": "Fecha de nacimiento",
    "locationLabel": "Ubicación",
    "location": "Mairena del Alcor, Sevilla, 41510",
    "countryLabel": "País",
    "country": "España",
    "emailLabel": "Email",
    "email": "humbertolopezdev@gmail.com",
    "hobbiesLabel": "Aficiones",
    "hobbies": "Videografía, fotografía, música y modelado 3D.",
    "biographyTitle": "Mi biografía",
    "biographyContent": "Soy un chico de 26 años nacido en Mairena del Alcor, un pueblo de Sevilla. Desde pequeño me han llamado la atención las tecnologías y su funcionamiento.",
    "biographyContent2": "Junto a mi padre jugaba con pequeños experimentos de electrónica y construyendo maquetas manejadas con radiocontrol. Más adelante, me adentré en la programación con programas como Scratch o blogs con la tecnología de blogger en los que modificaba el código o incluía widgets de manera totalmente manual.",
    "biographyContent3": "Decidí estudiar programación a la vez que estudiaba otra de mis pasiones, la música, en el Conservatorio Profesional de Música de Sevilla. En él aprendí las bases y conceptos de la programación orientada a objetos, los lenguajes multiplataforma y sus aplicaciones. También tuve la suerte de compartir esta etapa con compañeros muy profesionales que a día de hoy se encuentran trabajando en el desarrollo de software.",
    "biographyContent4": "Una vez terminados mis estudios, seguí desarrollando mis habilidades tanto en empresas como por mi cuenta. He podido desarrollar proyectos desde inicio hasta su etapa final de despliegue usando distintas tecnologías e implementando funcionalidades que hagan diferenciar mis proyectos sobre el resto.",
    "biographyContent5": "A día de hoy sigo encontrando la motivación para seguir aprendiendo no sólo en el desarrollo de software sino en otras áreas que me permitan adquirir habilidades que pueda usar en mi trabajo, como la edición de vídeo, el modelado 3D con Blender y otros programas, fotografía, y la música. En estas disciplinas encuentro la motivación incansable de nunca parar de aprender y crecer en todos los ámbitos."
  },
  "Technologies": {
    "technologiesTitle": "Tecnologías en las que tengo conocimientos",
    "technologiesIntro": "Aquí tienes algunas de las tecnologías con las que tengo experiencia.",
    "knowledgeDistribution": "Distribución de conocimientos",
    "knowledgeLevel": "Nivel de conocimiento"
  },
  "Contact": {
    "contactTitle": "Contacto",
    "contactIntro": "No dudes en enviarme un mensaje a través de este formulario o en mis redes sociales.",
    "nameLabel": "Tu Nombre",
    "emailLabel": "Tu Correo Electrónico",
    "subject": "Asunto",
    "messageLabel": "Tu Mensaje",
    "submitButton": "Enviar Mensaje",
    "formSubmission": "Tu mensaje ha sido enviado. ¡Gracias!",
    "socialTitle": "O conéctate conmigo en"
  },
  "experience": {
    "pageTitle": "Experiencia Profesional",
    "company1": "Montrel S.A.",
    "role1": "Desarrollador Frontend",
    "description1": "Desarrollo tecnológico para las principales compañías de carburantes españolas. Desarrollo front-end con Angular y Typescript. Backend desarrollado con .NET y SQL.",
    "startDate1": "Octubre 2023",
    "endDate1": "Actual",
    "company2": "Deloitte",
    "role2": "Desarrollador Backend",
    "description2": "Desarrollé soluciones de visualización de datos utilizando librerías de terceros de Angular, como Keppler.gl, ApexCharts.js y NGX-Graph. Gestioné migraciones a versiones más recientes de Salesforce con pipelines en Node.js. Creé soluciones para el sistema de gestión de archivos del Banco Central Europeo, Darwin, utilizando OpenText. Desarrollé soluciones de gestión de inversiones en React/Redux.",
    "startDate2": "Julio 2022",
    "endDate2": "Octubre 2023",
    "company3": "Ayesa",
    "role3": "Desarollador Fullstack",
    "description3": "Desarrollé soluciones para departamentos gubernamentales en la gestión de certificados digitales y el uso de bases de datos nacionales de población. Creé microservicios para el procesamiento de pagos y lideré el rediseño de la plataforma. Utilicé Spring Boot y PrimeFaces.",
    "startDate3": "Enero 2022",
    "endDate3": "Junio 2022",
    "company4": "Emergya",
    "role4": "Desarollador Fullstack",
    "description4": "Desarrollé soluciones con TypeScript y Node.js utilizando herramientas de aprendizaje automático para extraer información de archivos PDF e imágenes, categorizando los datos con expresiones regulares (RegEx). Creé una aplicación cliente en Angular para facilitar el envío de archivos.",
    "startDate4": "Julio 2021",
    "endDate4": "Diciembre 2021",
    "dateRange": "{start} - {end}",
    "otherTitle": "Trabajos freelance",
    "otherContent": "Consulta mi experiencia en otros",
    "projects": "PROYECTOS"
  }
  
}